socialNetwork/wrk2/outs/c300_r250.out
Running 1m test @ http://10.101.21.23:8080/wrk2-api/post/compose
  2 threads and 300 connections
  Thread calibration: mean lat.: 2.941ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.034ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.43ms    2.08ms  11.89ms   89.12%
    Req/Sec   130.92    115.63   444.00     58.73%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.72ms
 75.000%    3.73ms
 90.000%    5.70ms
 99.000%   11.89ms
 99.900%   19.87ms
 99.990%   28.35ms
 99.999%   29.73ms
100.000%   29.73ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.209     0.000000            1         1.00
       2.033     0.100000         1241         1.11
       2.207     0.200000         2488         1.25
       2.357     0.300000         3734         1.43
       2.521     0.400000         4965         1.67
       2.723     0.500000         6193         2.00
       2.851     0.550000         6813         2.22
       2.993     0.600000         7435         2.50
       3.181     0.650000         8056         2.86
       3.403     0.700000         8671         3.33
       3.729     0.750000         9289         4.00
       3.907     0.775000         9600         4.44
       4.143     0.800000         9908         5.00
       4.415     0.825000        10219         5.71
       4.759     0.850000        10531         6.67
       5.219     0.875000        10842         8.00
       5.455     0.887500        10995         8.89
       5.703     0.900000        11147        10.00
       6.011     0.912500        11302        11.43
       6.379     0.925000        11457        13.33
       6.815     0.937500        11611        16.00
       7.067     0.943750        11689        17.78
       7.371     0.950000        11766        20.00
       7.719     0.956250        11844        22.86
       8.187     0.962500        11922        26.67
       8.631     0.968750        11998        32.00
       8.911     0.971875        12037        35.56
       9.287     0.975000        12076        40.00
       9.655     0.978125        12115        45.71
       9.991     0.981250        12154        53.33
      10.503     0.984375        12192        64.00
      10.759     0.985938        12211        71.11
      11.127     0.987500        12231        80.00
      11.631     0.989062        12250        91.43
      12.079     0.990625        12270       106.67
      12.751     0.992188        12289       128.00
      13.279     0.992969        12298       142.22
      13.487     0.993750        12308       160.00
      14.071     0.994531        12318       182.86
      14.607     0.995313        12327       213.33
      15.559     0.996094        12337       256.00
      16.031     0.996484        12342       284.44
      16.351     0.996875        12347       320.00
      16.463     0.997266        12352       365.71
      17.215     0.997656        12356       426.67
      17.807     0.998047        12361       512.00
      18.015     0.998242        12364       568.89
      18.511     0.998437        12366       640.00
      19.215     0.998633        12369       731.43
      19.679     0.998828        12371       853.33
      19.871     0.999023        12373      1024.00
      20.767     0.999121        12375      1137.78
      22.079     0.999219        12376      1280.00
      22.351     0.999316        12377      1462.86
      22.399     0.999414        12378      1706.67
      22.495     0.999512        12379      2048.00
      23.871     0.999561        12380      2275.56
      23.999     0.999609        12381      2560.00
      23.999     0.999658        12381      2925.71
      24.367     0.999707        12382      3413.33
      24.367     0.999756        12382      4096.00
      25.583     0.999780        12383      4551.11
      25.583     0.999805        12383      5120.00
      25.583     0.999829        12383      5851.43
      28.351     0.999854        12384      6826.67
      28.351     0.999878        12384      8192.00
      28.351     0.999890        12384      9102.22
      28.351     0.999902        12384     10240.00
      28.351     0.999915        12384     11702.86
      29.727     0.999927        12385     13653.33
      29.727     1.000000        12385          inf
#[Mean    =        3.429, StdDeviation   =        2.079]
#[Max     =       29.712, Total count    =        12385]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14922 requests in 1.00m, 3.68MB read
  Socket errors: connect 0, read 0, write 0, timeout 1634
  Non-2xx or 3xx responses: 14922
Requests/sec:    248.79
Transfer/sec:     62.82KB