socialNetwork/wrk2/outs/c500_r10.out
Running 1m test @ http://10.101.21.23:8080/wrk2-api/post/compose
  2 threads and 500 connections
  Thread calibration: mean lat.: 3.088ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.228ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.04ms  592.98us   5.11ms   77.07%
    Req/Sec     5.61     24.51   111.00     94.82%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.93ms
 75.000%    3.30ms
 90.000%    3.71ms
 99.000%    5.11ms
 99.900%    7.06ms
 99.990%    7.12ms
 99.999%    7.12ms
100.000%    7.12ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.844     0.000000            1         1.00
       2.441     0.100000           54         1.11
       2.559     0.200000          108         1.25
       2.701     0.300000          160         1.43
       2.805     0.400000          213         1.67
       2.927     0.500000          266         2.00
       3.001     0.550000          293         2.22
       3.077     0.600000          320         2.50
       3.147     0.650000          346         2.86
       3.233     0.700000          373         3.33
       3.301     0.750000          399         4.00
       3.347     0.775000          413         4.44
       3.409     0.800000          426         5.00
       3.489     0.825000          439         5.71
       3.533     0.850000          453         6.67
       3.637     0.875000          466         8.00
       3.691     0.887500          474         8.89
       3.707     0.900000          479        10.00
       3.841     0.912500          486        11.43
       3.937     0.925000          493        13.33
       3.987     0.937500          500        16.00
       4.021     0.943750          503        17.78
       4.045     0.950000          506        20.00
       4.099     0.956250          509        22.86
       4.127     0.962500          513        26.67
       4.207     0.968750          516        32.00
       4.235     0.971875          518        35.56
       4.251     0.975000          519        40.00
       4.427     0.978125          521        45.71
       4.631     0.981250          523        53.33
       4.711     0.984375          524        64.00
       4.779     0.985938          525        71.11
       4.791     0.987500          526        80.00
       5.115     0.989062          527        91.43
       5.235     0.990625          528       106.67
       5.235     0.992188          528       128.00
       5.459     0.992969          529       142.22
       5.459     0.993750          529       160.00
       5.647     0.994531          530       182.86
       5.647     0.995313          530       213.33
       5.647     0.996094          530       256.00
       7.059     0.996484          531       284.44
       7.059     0.996875          531       320.00
       7.059     0.997266          531       365.71
       7.059     0.997656          531       426.67
       7.059     0.998047          531       512.00
       7.119     0.998242          532       568.89
       7.119     1.000000          532          inf
#[Mean    =        3.038, StdDeviation   =        0.593]
#[Max     =        7.116, Total count    =          532]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  636 requests in 1.01m, 160.35KB read
  Socket errors: connect 0, read 0, write 0, timeout 13903
  Non-2xx or 3xx responses: 636
Requests/sec:     10.55
Transfer/sec:      2.66KB