socialNetwork/wrk2/outs/c500_r100.out
Running 1m test @ http://10.101.21.23:8080/wrk2-api/post/compose
  2 threads and 500 connections
  Thread calibration: mean lat.: 2.776ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.728ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.86ms    1.06ms   7.59ms   91.75%
    Req/Sec    51.71     74.05   300.00     90.87%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.59ms
 75.000%    3.02ms
 90.000%    3.69ms
 99.000%    7.59ms
 99.900%   13.90ms
 99.990%   20.53ms
 99.999%   20.53ms
100.000%   20.53ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.065     0.000000            1         1.00
       2.171     0.100000          497         1.11
       2.291     0.200000          989         1.25
       2.383     0.300000         1474         1.43
       2.477     0.400000         1959         1.67
       2.587     0.500000         2450         2.00
       2.647     0.550000         2702         2.22
       2.711     0.600000         2943         2.50
       2.799     0.650000         3189         2.86
       2.889     0.700000         3430         3.33
       3.015     0.750000         3674         4.00
       3.085     0.775000         3798         4.44
       3.171     0.800000         3921         5.00
       3.249     0.825000         4041         5.71
       3.351     0.850000         4163         6.67
       3.497     0.875000         4285         8.00
       3.591     0.887500         4347         8.89
       3.691     0.900000         4410        10.00
       3.815     0.912500         4469        11.43
       3.947     0.925000         4530        13.33
       4.143     0.937500         4591        16.00
       4.243     0.943750         4622        17.78
       4.415     0.950000         4653        20.00
       4.695     0.956250         4683        22.86
       4.827     0.962500         4715        26.67
       5.159     0.968750         4744        32.00
       5.343     0.971875         4760        35.56
       5.567     0.975000         4775        40.00
       5.811     0.978125         4790        45.71
       6.087     0.981250         4806        53.33
       6.535     0.984375         4821        64.00
       6.667     0.985938         4829        71.11
       6.959     0.987500         4836        80.00
       7.359     0.989062         4844        91.43
       7.663     0.990625         4852       106.67
       7.991     0.992188         4859       128.00
       8.103     0.992969         4864       142.22
       8.255     0.993750         4867       160.00
       8.495     0.994531         4871       182.86
       8.903     0.995313         4876       213.33
       9.231     0.996094         4878       256.00
       9.639     0.996484         4880       284.44
       9.871     0.996875         4882       320.00
      10.215     0.997266         4884       365.71
      10.703     0.997656         4886       426.67
      11.023     0.998047         4889       512.00
      11.023     0.998242         4889       568.89
      11.631     0.998437         4890       640.00
      12.487     0.998633         4891       731.43
      13.895     0.998828         4892       853.33
      13.967     0.999023         4893      1024.00
      13.967     0.999121         4893      1137.78
      14.951     0.999219         4894      1280.00
      14.951     0.999316         4894      1462.86
      16.687     0.999414         4895      1706.67
      16.687     0.999512         4895      2048.00
      16.687     0.999561         4895      2275.56
      17.903     0.999609         4896      2560.00
      17.903     0.999658         4896      2925.71
      17.903     0.999707         4896      3413.33
      17.903     0.999756         4896      4096.00
      17.903     0.999780         4896      4551.11
      20.527     0.999805         4897      5120.00
      20.527     1.000000         4897          inf
#[Mean    =        2.856, StdDeviation   =        1.063]
#[Max     =       20.512, Total count    =         4897]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5938 requests in 1.00m, 1.46MB read
  Socket errors: connect 0, read 0, write 0, timeout 9734
  Non-2xx or 3xx responses: 5938
Requests/sec:     98.95
Transfer/sec:     24.97KB